wmsmobile/src/Documents/итНаборка/итНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итНаборка</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FSRARID</name>
    <comment>ид для печати SSCC</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйПризнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wmsmobile/src/InformationRegisters/итЗадачиКРаспределению/итЗадачиКРаспределению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итЗадачиКРаспределению</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДокументОснованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wmsmobile/src/Enums/итWMSСостоянияЗадачТСД/итWMSСостоянияЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSСостоянияЗадачТСД</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРазрешения</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
</mdclass:Enum>

wmsmobile/src/Enums/итWMSТипыЗадачТСД/итWMSТипыЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>итWMSТипыЗадачТСД</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>Наборка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКакЕсть</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяАгрегация</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
</mdclass:Enum>

wmsmobile/src/Documents/итНаборка/Forms/ФормаСпискаНаборокКРаспределениюМаршрута/Module.bsl
&НаКлиенте
Процедура Назад(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	    Строка=ТекущийЭлемент.ТекущиеДанные;
		ИдЗадачиДляПоиска=ПолучитьДанныеИдЗадачиПоДокументу(Строка.ДокументОснование);
       Если ИдЗадачиДляПоиска=Неопределено Тогда 
			Сообщить("задача не найдена");
			Возврат
		КонецЕсли;
		КлючЗаписи=ПоискИСозданиеКлючаЗаписиПоИдЗадачи(ИдЗадачиДляПоиска);
		Если КлючЗаписи=Неопределено Тогда 
			Сообщить("задача не найдена");
			Возврат
		КонецЕсли;	
		ОткрытьФорму("Обработка.ДиспетчерЗадач.Форма.ФормаВыбораДействий",новый Структура("КлючЗаписи,ВыборДокумента",КлючЗаписи,Истина),ЭтаФорма);
		ТригерПриемаСканераШтрихКода=Ложь;
	КонецПроцедуры
	
&НаСервереБезКонтекста	
Функция ПоискИСозданиеКлючаЗаписиПоИдЗадачи(Знач ИдЗадачи)
	Если ТипЗнч(ИдЗадачи)=Тип("Строка") Тогда 
		ИдЗадачи=новый УникальныйИдентификатор(ИдЗадачи);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	итЗадачиКРаспределению.ДокументОснование КАК ДокументОснование,
	|	итЗадачиКРаспределению.ТипЗадачи КАК ТипЗадачи,
	|	итЗадачиКРаспределению.ИдЗадачи КАК ИдЗадачи,
	|	итЗадачиКРаспределению.ИдентификаторУпаковки КАК ИдентификаторУпаковки,
	|	итЗадачиКРаспределению.Состояние КАК Состояние
	|ИЗ
	|	РегистрСведений.итЗадачиКРаспределению КАК итЗадачиКРаспределению
	|ГДЕ
	|	итЗадачиКРаспределению.Состояние = ЗНАЧЕНИЕ(Перечисление.итWMSСостоянияЗадачТСД.КВыполнению)
	|	И итЗадачиКРаспределению.ИдЗадачи = &ИдЗадачи";
	
	Запрос.УстановитьПараметр("ИдЗадачи", ИдЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
		КлючЗаписи=РегистрыСведений.итЗадачиКРаспределению.СоздатьКлючЗаписи(новый Структура("ДокументОснование,ТипЗадачи,ИдЗадачи",ВыборкаДетальныеЗаписи.ДокументОснование,ВыборкаДетальныеЗаписи.ТипЗадачи,ВыборкаДетальныеЗаписи.ИдЗадачи));
		Возврат КлючЗаписи;
	КонецЕсли;
	Возврат Неопределено;
	
	
КонецФункции
	
&НаСервереБезКонтекста
Функция ПолучитьДанныеИдЗадачиПоДокументу(ДокументОснование)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	итЗадачиКРаспределению.ИдЗадачи КАК ИдЗадачи
		|ИЗ
		|	РегистрСведений.итЗадачиКРаспределению КАК итЗадачиКРаспределению
		|ГДЕ
		|	итЗадачиКРаспределению.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.ИдЗадачи;
	КонецЕсли;
	Возврат Неопределено;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		 ОбработчкаПолученияДанныхШтрихКода(Параметр);
	 КонецЕсли;

 КонецПроцедуры
&НаКлиенте
 Процедура ОбработчкаПолученияДанныхШтрихКода(Параметр)
	 КонецПроцедуры

&НаКлиенте
Процедура КЗадачам(Команда)
Строка=Элементы.Список.ТекущиеДанные;
ОткрытьФорму("Документ.итНаборка.Форма.ФормаЗадачиКРаспределениюНаборки",новый Структура("ДокументОснование",Строка.ДокументОснование),ЭтаФорма);
ТригерПриемаСканераШтрихКода=Ложь;
 КонецПроцедуры

&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
 МаршрутГУИД=Неопределено;
 Параметры.Свойство("МаршрутГУИД",МаршрутГУИД);
 Список.Параметры.УстановитьЗначениеПараметра("Реквизит1ГУИД",МаршрутГУИД);
 КонецПроцедуры

&НаСервереБезКонтекста
 Процедура ОбновитьНаСервере()
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("ТипЗадачи",Перечисления.итWMSТипыЗадачТСД.Наборка);
	ОбработчикиЗапросаСервера.ОбновитьСписокЗадачКРаспределению(СтруктураДанных);

 КонецПроцедуры

&НаКлиенте
 Процедура Обновить(Команда)
	 ОбновитьНаСервере();
	 Элементы.Список.Обновить();
 КонецПроцедуры
